In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
arr = np.array([[1, 2, np.nan], [np.nan, 3, 4]])
arr

array([[ 1.,  2., nan],
       [nan,  3.,  4.]])

In [9]:
dframe1 = DataFrame(arr, index = ["A", "B"], columns = ["One", "Two", "Three"])
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [11]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [13]:
dframe1.sum(axis = 1)

A    3.0
B    7.0
dtype: float64

In [15]:
dframe1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [19]:
# min by index
dframe1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [21]:
dframe1.idxmax()

One      A
Two      B
Three    B
dtype: object

In [23]:
# cumulative sum of columns
dframe1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [25]:
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [35]:
# covariance video https://www.youtube.com/watch?v=xGbpuFNR1ME
# correlation video https://www.youtube.com/watch?v=4EXNedimDMs

In [9]:
from pandas_datareader import data as pdr
import datetime as dt

In [79]:
start_date = dt.datetime(2020, 1, 1)
end_date = dt.datetime(2023, 1, 1)

prices = pdr.DataReader(['CVX', "BP", "XOM"], 'stooq', start = start_date, end = end_date)

prices.head()

Attributes   Close                     High                     Low           \
Symbols        CVX     BP     XOM       CVX     BP      XOM     CVX       BP
Date
2022-12-30  179.49  34.93  110.30  179.9500  34.96  110.500  177.70  34.4700
2022-12-29  178.32  34.70  109.20  179.2000  34.85  109.720  176.65  34.4900
2022-12-28  176.98  34.58  108.38  179.2981  35.42  110.000  175.93  34.4901
2022-12-27  179.63  35.04  110.19  180.2300  35.16  110.465  177.40  34.8800
2022-12-23  177.40  35.01  108.68  177.5800  35.05  108.740  173.69  34.5350

Attributes             Open                    Volume
Symbols         XOM     CVX     BP     XOM        CVX         BP         XOM
Date
2022-12-30  108.610  178.03  34.52  108.61  5005094.0  4823003.0  11799640.0
2022-12-29  107.990  176.65  34.54  107.99  4142090.0  4881631.0  10534028.0
2022-12-28  107.902  178.86  35.42  109.91  4494350.0  5232380.0  10702075.0
2022-12-27  108.830  178.36  35.00  109.27  5167962.0  4325978.0  11962058.0
2022-12-23  106.900  174.10  34.63  106.95  6079120.0  5191839.0  11539448.0